#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""
Test 2
Написать программу для библиотеки, которая ведет учет
выданных на руки книг и газет. Необходимо, чтобы
программа реализовывала следующие функции и ограничения:

5 баллов:
1. на руках у одного человека не может быть одновременно
больше 3х наименований книг и/или газет
2. вывести сколько книг(газет) на руках у конкретного
человека

10 баллов
3. вывести кто больше всего книг(газет) прочел
4. вывести какую книгу(газету) чаще всего берут почитать

15 баллов
5. вывести что больше читают - книги или газеты
"""

book_archive = []
npaper_archive = []


class Hand:
    def __init__(self):
        pass


class Book:
    def __init__(self):
        pass


class Newspaper:
    def __init__(self):
        pass
